infrastructure/stage-2/load-test-results-stage2/test1-baseline.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking ioc-labs-alb-265805501.us-east-1.elb.amazonaws.com (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        
Server Hostname:        ioc-labs-alb-265805501.us-east-1.elb.amazonaws.com
Server Port:            80

Document Path:          /api/products
Document Length:        4441 bytes

Concurrency Level:      100
Time taken for tests:   98.918 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      47020000 bytes
HTML transferred:       44410000 bytes
Requests per second:    101.09 [#/sec] (mean)
Time per request:       989.178 [ms] (mean)
Time per request:       9.892 [ms] (mean, across all concurrent requests)
Transfer rate:          464.20 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      237  670 1237.0    286   32730
Processing:   240  299  55.0    284    1217
Waiting:      239  296  52.3    282    1216
Total:        481  969 1236.6    587   33034

Percentage of the requests served within a certain time (ms)
  50%    587
  66%    641
  75%    703
  80%    795
  90%   1615
  95%   3666
  98%   3731
  99%   3804
 100%  33034 (longest request)